{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Name a yearly celebration occuring during the winter solctice that contains the word \"yule\" in its name"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q200538 . ?sbj wdt:P837 wd:Q207932 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yule')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the lunar calendar which start with the letter calendar"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q185688 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'calendar')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Which is the business with the headquarters location in Barcelona?"}, {"role": "assistant", "content": "select distinct ?sbj where { ?sbj wdt:P159 wd:Q1492 . ?sbj wdt:P31 wd:Q4830453 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Princeton University has how many parent organization?"}, {"role": "assistant", "content": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P749 wd:Q21578 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Mention the source composition of sweetbread."}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q49951 wdt:P1582 ?X . ?X wdt:P1672 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is the family name for writing the Hebrew alphabet"}, {"role": "assistant", "content": "select distinct ?sbj where { ?sbj wdt:P282 wd:Q33513 . ?sbj wdt:P31 wd:Q101352 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "TELL ME THE CREATION MYTH THAT CONTAINS THE WORD DEAMTIME IN THEIR NAME"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q215304 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'dreamtime')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me ceremonial county of England whose name has the word yorkshire in it."}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q180673 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yorkshire')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "When was Irving Langmuir nominated for a Nobel Prize in Chemistry?"}, {"role": "assistant", "content": "SELECT ?value WHERE { wd:Q184286 p:P1411 ?s . ?s ps:P1411 wd:Q44585 . ?s pq:P585 ?value}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What fan convention starts with the letter \"v\"?"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1129398 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is the Wylie transliteration for Abhidharma, that is labelled as \u0f58\u0f5b\u0f7c\u0f51\u0f0b\u0f55\u0f74\u0f42?"}, {"role": "assistant", "content": "SELECT ?value WHERE { wd:Q612405 p:P1705 ?s . ?s ps:P1705 ?x filter(contains(?x,'\u0f58\u0f5b\u0f7c\u0f51\u0f0b\u0f55\u0f74\u0f42')) . ?s pq:P4187 ?value}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Give me the series ordinal for the Lion King with film crew member Lisa Keene."}, {"role": "assistant", "content": "SELECT ?value WHERE { wd:Q36479 p:P3092 ?s . ?s ps:P3092 wd:Q3242412 . ?s pq:P1545 ?value}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "what is book of the bible starts with s"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q29154430 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Name a language family that contains the word \"languages\" in its name"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q25295 . ?sbj wdt:P4132 wd:Q318917 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'languages')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Who is the {geography of geographic location} for {geography of topic} of {Arab League}"}, {"role": "assistant", "content": "select distinct ?obj where { wd:Q7172 wdt:P2633 ?obj . ?obj wdt:P31 wd:Q46865913 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "TELL ME INTERNATIONAL SPORT GOVERNING BODY WHOSE NAME HAS THE WORD WORLD IN IT."}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11422536 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'world')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What political party did Chen Shui-bian belong to in 1987-02-28?"}, {"role": "assistant", "content": "SELECT ?obj WHERE { wd:Q22368 p:P102 ?s . ?s ps:P102 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1987')) }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me a specialty that starts with the letter w."}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1047113 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me asymmetric warfare  whose name has the word drug  in it."}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q752673 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'drug')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me taxation whose name has the word sam in it."}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1964442 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tithe')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Who is the {gene} for {genetic association} of {hepatitis C}"}, {"role": "assistant", "content": "select distinct ?sbj where { ?sbj wdt:P2293 wd:Q154869 . ?sbj wdt:P31 wd:Q7187 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the hypostasis which contains the word holy in their name"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q651118 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'holy')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the Catholic cathedral which start with the letter saint"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q56242215 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'saint')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Who is the {human} for {partner} of {Paul Thomas Anderson}"}, {"role": "assistant", "content": "select distinct ?obj where { wd:Q25132 wdt:P451 ?obj . ?obj wdt:P31 wd:Q5 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What sovereign states does the US Declaration of Independence apply to"}, {"role": "assistant", "content": "select distinct ?obj where { wd:Q127912 wdt:P1001 ?obj . ?obj wdt:P31 wd:Q3624078 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "what time does Martin Johnson start as a member of the England national rugby union team"}, {"role": "assistant", "content": "SELECT ?value WHERE { wd:Q2036406 p:P54 ?s . ?s ps:P54 wd:Q378628 . ?s pq:P580 ?value}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is a phase change that starts with the letter s."}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q185357 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What gravitational-wave detector contains the word \"virgo\" in its name?"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2302080 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'virgo')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Who is the  {enterprise} for {chief executive officer} of {Michael Dell}"}, {"role": "assistant", "content": "select distinct ?sbj where { ?sbj wdt:P169 wd:Q218630 . ?sbj wdt:P31 wd:Q6881511 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is chemical formula of diamond."}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q5283 wdt:P186 ?X . ?X wdt:P246 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Name the water body comprised of the Paramaribo"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q3001 wdt:P206 ?X . ?X wdt:P974 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the fairy tale which start with the letter w"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q699 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "what is the subject of the history of Asia, that has time zone is Magadan"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q627531 wdt:P1269 ?answer . ?answer wdt:P421 wd:Q385504}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is the alphabet of Furutachi based upon?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q27306164 wdt:P282 ?X . ?X wdt:P144 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the chemical reaction which start with the letter s"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q36534 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "When is the date of commencement of the book publish for Astronomy and Astrophysics"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q752075 wdt:P123 ?X . ?X wdt:P571 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Who is the partner of Michel Foucault"}, {"role": "assistant", "content": "select distinct ?sbj where { ?sbj wdt:P451 wd:Q44272 . ?sbj wdt:P31 wd:Q5 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the educational stage which start with the letter s"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q18189 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'k')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Who has the native label of \ub2e8 and revised romanization for Mandala"}, {"role": "assistant", "content": "SELECT ?value WHERE { wd:Q191431 p:P1705 ?s . ?s ps:P1705 ?x filter(contains(?x,'\ub2e8')) . ?s pq:P2001 ?value}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Name a city that contains the word \" manila\" in its name"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1907114 . ?sbj wdt:P126 wd:Q259278 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'manila')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Was the democratic republic a participant of the American Revolution"}, {"role": "assistant", "content": "select distinct ?sbj where { ?sbj wdt:P1344 wd:Q40949 . ?sbj wdt:P31 wd:Q5255892 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "When was the capital of Assyria Carchemish?"}, {"role": "assistant", "content": "SELECT ?value WHERE { wd:Q41137 p:P36 ?s . ?s ps:P36 wd:Q283680 . ?s pq:P585 ?value}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the film studio which start with the letter s"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5333510 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tripartism')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me me a Norse deity whose name consist of the word \"tyr\" and whose worshipped by Norse mythology"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16513881 . ?sbj wdt:P1049 wd:Q128285 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tyr')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What country is David Ricardo a citizen of?"}, {"role": "assistant", "content": "SELECT ?obj WHERE { wd:Q160270 p:P27 ?s . ?s ps:P27 ?obj . ?s pq:P1534 wd:Q343100 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Mention the television series featured by executive producer John Oliver."}, {"role": "assistant", "content": "select distinct ?sbj where { ?sbj wdt:P1431 wd:Q1701254 . ?sbj wdt:P31 wd:Q5398426 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me boat type whose name has the word yoal  in it."}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16103215 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yoal')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me fictional detective whose name has the word sam in it."}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q748720 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'european')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is an historical period that starts with the letter v."}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11514315 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the disciplinary repository which start with the letter E"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5281480 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'e')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "who is painter of dilbert that his last name is adams"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q726431 wdt:P170 ?answer . ?answer wdt:P734 wd:Q351735}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "WHICH IS THE FUNDAMETAL INTERACTION THE CONTAINS THE WORD INTERACTION IN THEIR NAME"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q104934 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'interaction')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the dialect which start with the letter W"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q33384 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Name a videogame developped by CPU that contains the word \"pong\" in its name"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7889 . ?sbj wdt:P880 wd:Q11653 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'pong')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "which public educational institution of the United States starts with letter u"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23002039 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'u')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me me a therapywhose name consist of the word \"woman\" and whose Sigmund Freud  psychoanalysis"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q179661 . ?sbj wdt:P50 wd:Q9215 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'psychoanalysis')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the unit of measurement which start with the letter visus"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q47574 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'visus')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me civil parish  whose name has the word winmarleigh  in it."}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1115575 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'winmarleigh')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me fictional detective whose name has the word hydro in it."}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1244922 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'hydro')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "When did Peyton Manning play for the Tennessee Volunteers Football"}, {"role": "assistant", "content": "SELECT ?value WHERE { wd:Q7539 p:P54 ?s . ?s ps:P54 wd:Q12070759 . ?s pq:P580 ?value}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me a children's game that starts with the letter z."}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1509934 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
