{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Name the Wikimedia categorization for the employees of the Princeton University organization."}, {"role": "assistant", "content": "select distinct ?obj where { wd:Q21578 wdt:P4195 ?obj . ?obj wdt:P31 wd:Q4167836 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Who are the cast members of Die Hard"}, {"role": "assistant", "content": "select distinct ?obj where { wd:Q105598 wdt:P161 ?obj . ?obj wdt:P31 wd:Q5 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is DRTL?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q133279 wdt:P654 ?X . ?X wdt:P461 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Who gave the {speakers of language} of {second language} of {Juan Sebasti\u00e1n Elcano} ?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q201510 wdt:P1412 ?X . ?X wdt:P1098 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Which bridge is upstream of the London bridge"}, {"role": "assistant", "content": "select distinct ?obj where { wd:Q130206 wdt:P2673 ?obj . ?obj wdt:P31 wd:Q1055465 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Who was the person behind the sponsorship of Vincent van Gogh"}, {"role": "assistant", "content": "select distinct ?obj where { wd:Q5582 wdt:P859 ?obj . ?obj wdt:P31 wd:Q5 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Who is the person with the lowest score in ski jumping."}, {"role": "assistant", "content": "select ?ent where { ?ent wdt:P31 wd:Q5 . ?ent wdt:P2415 ?obj . ?ent wdt:P641 wd:Q7718} ORDER BY ASC(?obj)LIMIT 5"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is the statistical system for Hebrew"}, {"role": "assistant", "content": "select distinct ?sbj where { ?sbj wdt:P37 wd:Q9288 . ?sbj wdt:P31 wd:Q55456485 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "who major works of coined of rubik\u2019s tangle?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q2171608 wdt:P61 ?X . ?X wdt:P800 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What Canadian river has its discharge located in Whitefield?"}, {"role": "assistant", "content": "SELECT ?obj WHERE { wd:Q597753 p:P2225 ?s . ?s ps:P2225 ?obj . ?s pq:P276 wd:Q2380417 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "WHICH IS THE HUMAN WITH THE MAX POINTS FOR"}, {"role": "assistant", "content": "select ?ent where { ?ent wdt:P31 wd:Q5 . ?ent wdt:P1358 ?obj } ORDER BY DESC(?obj)LIMIT 5"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What condition starts with the letter \"t\"?"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q813912 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is a superpower that starts with the letter w."}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1047698 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "WHICH HAS INFLUENCE OF POTRAIT OF HEY JUDE"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q607742 wdt:P175 ?X . ?X wdt:P737 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Who is the {inner planet} for {parent astronomical body} of {International Space Station}"}, {"role": "assistant", "content": "select distinct ?obj where { wd:Q25271 wdt:P397 ?obj . ?obj wdt:P31 wd:Q3504248 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Name the color film with the fewest episodes ."}, {"role": "assistant", "content": "select ?ent where { ?ent wdt:P31 wd:Q11424 . ?ent wdt:P1113 ?obj . ?ent wdt:P462 wd:Q22006653. } ORDER BY ASC(?obj)LIMIT 5"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "which is award received of judith anderson that is point time is 1948?"}, {"role": "assistant", "content": "SELECT ?obj WHERE { wd:Q230415 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1948')) }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Mention the language spoken and understood by L. Ron Hubbard"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q216896 wdt:P1412 ?X . ?X wdt:P1098 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "WHAT IS THE ZIPCODE OF ALUMNUS OF HOBEY BAKER"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q1348425 wdt:P69 ?X . ?X wdt:P281 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What product, made from raspberry, has the common name \u041c\u0430\u043b\u0438\u043d\u0430?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q13179 wdt:P1582 ?answer . ?answer wdt:P1843 ?x FILTER(contains(?x,'\u041c\u0430\u043b\u0438\u043d\u0430'))}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the superseded scientific theory which start with the letter v"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4115113 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "For what temperature does sulfur dioxide has 3.2 vapor pressure?"}, {"role": "assistant", "content": "SELECT ?value WHERE { wd:Q5282 p:P2119 ?s . ?s ps:P2119 ?x filter(contains(?x,'3.2')) . ?s pq:P2076 ?value}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Complete information for the GCFC2 gene."}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q18302702 wdt:P688 ?X . ?X wdt:P681 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is the role model of the doctoral supervisor of Carl Neumann?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q77313 wdt:P184 ?X . ?X wdt:P737 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me which Web API contains the word xmlhttprequest in its name"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20202982 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'xmlhttprequest')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Name the flavored tea named after Charles Grey that contains the word \"earl\" in its name"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3526264 . ?sbj wdt:P138 wd:Q294662 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'earl')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "TELL ME COMMUNICATIONS PROTOCOL WHICH START WITH THE LETTER Z"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q132364 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "In what year did John XXIII receive a Balzan Prize?"}, {"role": "assistant", "content": "SELECT ?value WHERE { wd:Q23873 p:P166 ?s . ?s ps:P166 wd:Q628457 . ?s pq:P585 ?value}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "who won by of prize received of john le carr\u00e9 ?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q209641 wdt:P166 ?X . ?X wdt:P1346 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Name the position that Frederick North, who passed away on December 19, 1783, held."}, {"role": "assistant", "content": "SELECT ?obj WHERE { wd:Q312593 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1783')) }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is the aspect of the president in History of Tonga?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q1075000 wdt:P1269 ?X . ?X wdt:P35 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me the basic emotion which contains the word trust in their name!"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16748867 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'trust')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the political philosophy which start with the letter w"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q179805 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "On 1-1-1678 William Petty, 2nd Earl of Shelburne founded what party membership"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q312573 wdt:P102 ?answer . ?answer wdt:P571 ?x FILTER(contains(YEAR(?x),'1678'))}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Mention the striking painting work of John the Baptist"}, {"role": "assistant", "content": "select distinct ?obj where { wd:Q40662 wdt:P1299 ?obj . ?obj wdt:P31 wd:Q3305213 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is the name of this isolated human group that contain the word \"wenrohronon\" in their name ?"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3117863 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'wenrohronon')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "In 1930, what was the capital of T\u00fcrkmenabat?"}, {"role": "assistant", "content": "SELECT ?obj WHERE { wd:Q487684 p:P1376 ?s . ?s ps:P1376 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1930')) }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Name an hill in Asia that contains the word \"ridges\" in its name"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q54050 . ?sbj wdt:P30 wd:Q48 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'ridges')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "How many movements are for The Internationale ?"}, {"role": "assistant", "content": "SELECT (COUNT(?obj) AS ?value ) { wd:Q49617 wdt:P135 ?obj }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Who wrote the script to \"The fault in Our Stars"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q14704171 wdt:P1877 ?X . ?X wdt:P737 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me religious concept whose name has the word yojana in it."}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23847174 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yojana')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the Stellar wind which start with the letter s"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q654396 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What political part does Silvio Berlusconi represent"}, {"role": "assistant", "content": "select distinct ?sbj where { ?sbj wdt:P210 wd:Q11860 . ?sbj wdt:P31 wd:Q7278 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Who is the husband and child of Anthony Dryden Marshall"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q4772424 wdt:P22 ?X . ?X wdt:P26 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Who formed the Rammstein brand"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q25177 wdt:P264 ?X . ?X wdt:P112 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me the programming paradigm which starts with letter p!"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q188267 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'p')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What themes are developed by the Biblical story of Noah?"}, {"role": "assistant", "content": "select distinct ?sbj where { ?sbj wdt:P3342 wd:Q81422 . ?sbj wdt:P31 wd:Q1406161 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Name a chemical element located in the UK that contains the word \"strontium\" in its name"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11344 . ?sbj wdt:P189 wd:Q145 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'strontium')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What animation technique starts with the letter \"s\"?"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3516833 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What sovereign state starts with the letter \"y\"?"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3624078 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'y')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Who is the daughter in the musical The Beat That My Heart Skipped"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q931671 wdt:P86 ?X . ?X wdt:P40 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the type of business entity which start with the letter S"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1269299 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me famine whose name has the word turnip in it."}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q168247 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'turnip')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What time zone, Durr\u00ebs, is located at standard time?"}, {"role": "assistant", "content": "SELECT ?obj WHERE { wd:Q83285 p:P421 ?s . ?s ps:P421 ?obj . ?s pq:P1264 wd:Q1777301 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the new religious movement which start with the letter syntheism"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q477544 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'syntheism')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me weekly newspaper whose name has the word es in it."}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2305295 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), '\u00e9s')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Due to what disease for anatomical location of human leg"}, {"role": "assistant", "content": "select distinct ?sbj where { ?sbj wdt:P927 wd:Q6027402 . ?sbj wdt:P31 wd:Q12136 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "which is prequel of colors of the secret of the black window?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q1168051 wdt:P462 ?X . ?X wdt:P156 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Name the cause and effect of Hepatitis."}, {"role": "assistant", "content": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q131742 wdt:P828 ?ans_1 . wd:Q131742 wdt:P1542 ?ans_2 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Mention the medicinal specialty maintained by positive regulation of hypersensitivity"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q21102285 wdt:P128 ?X . ?X wdt:P1995 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me the sister city of the death place of Adolph Sulyomi-Schulmann"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q1292341 wdt:P20 ?X . ?X wdt:P190 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is the genetic association of Maleria"}, {"role": "assistant", "content": "select distinct ?sbj where { ?sbj wdt:P2293 wd:Q12156 . ?sbj wdt:P31 wd:Q7187 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me phase change whose name has the word sublimation in it."}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q185357 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'sublimation')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "When did Lili Darvas become the spouse of Ferenc Moln\u00e1r ?"}, {"role": "assistant", "content": "SELECT ?value WHERE { wd:Q296809 p:P26 ?s . ?s ps:P26 wd:Q762952 . ?s pq:P580 ?value}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What award Vicente Aleixandre received in the year 1969?"}, {"role": "assistant", "content": "SELECT ?obj WHERE { wd:Q134644 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1969')) }"}]}
