{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me vocal group whose name has the word willows in it."}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q120544 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'willows')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me the comics character which start with letter v."}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1114461 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "WHICH ONE IS THE SPIRAL GALAXY WITH THE MOST RADIAL VELOCITY"}, {"role": "assistant", "content": "select ?ent where { ?ent wdt:P31 wd:Q2488 . ?ent wdt:P2216 ?obj } ORDER BY DESC(?obj)LIMIT 5"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Which rare disease killed Lou Gehrig?"}, {"role": "assistant", "content": "select distinct ?obj where { wd:Q357444 wdt:P509 ?obj . ?obj wdt:P31 wd:Q42303753 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me  system whose name has the word vendian  in it."}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q403523 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'vendian')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is the asteroid with the highest periapsis whose site of astronomical discovery is Landessternwarte Heidelberg-K\u00f6nigstuhl ?"}, {"role": "assistant", "content": "select ?ent where { ?ent wdt:P31 wd:Q3863 . ?ent wdt:P2244 ?obj . ?ent wdt:P65 wd:Q27115 } ORDER BY DESC(?obj)LIMIT 5"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is the Revised Hepburn romanization for Morning Musume with its name in kana \u30e2\u30fc\u30cb\u30f3\u30b0\u3080\u3059\u3081?"}, {"role": "assistant", "content": "SELECT ?value WHERE { wd:Q174291 p:P1814 ?s . ?s ps:P1814 ?x filter(contains(?x,'\u30e2\u30fc\u30cb\u30f3\u30b0\u3080\u3059\u3081')) . ?s pq:P2125 ?value}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me the branch of philosophy that contains the word {philosophy} in their name"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q22811234 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'philosophy')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is the name of a data structure that starts with the letter t."}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q175263 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me fallen angel whose name has the word zaqiel in it."}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q581450 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zaqiel')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me the United States federal executive department that contains the word department in their name"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q910252 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'department')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Who is the {historical country} for {shares border with} of {Roman Empire}"}, {"role": "assistant", "content": "select distinct ?obj where { wd:Q2277 wdt:P47 ?obj . ?obj wdt:P31 wd:Q3024240 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is Craig T. Nelson's spoken language whose name is abbreviated \u0430\u043d\u0433\u043b\u0438\u0439\u0441\u043a\u0438\u0439?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q329807 wdt:P1412 ?answer . ?answer wdt:P1813 ?x FILTER(contains(?x,'\u0430\u043d\u0433\u043b\u0438\u0439\u0441\u043a\u0438\u0439'))}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Znin is adjacent to Dusseldorg as they are twin cities."}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q1718 wdt:P47 ?answer . ?answer wdt:P190 wd:Q324941}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "How many male and female kids does Almanzor have?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q334861 wdt:P40 ?answer . ?answer wdt:P21 wd:Q6581097}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "WHICH IS THE GENETIC ASSOCIATION OF MURDER METHOD OF ALEXANDER WOOLLCOTT"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q361859 wdt:P509 ?X . ?X wdt:P2293 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "who sister town of born in of Huban \u00d6ztoprak ?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q16588877 wdt:P19 ?X . ?X wdt:P190 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Who is the  {plantation} for {architect} of {Thomas Jefferson}"}, {"role": "assistant", "content": "select distinct ?sbj where { ?sbj wdt:P84 wd:Q11812 . ?sbj wdt:P31 wd:Q188913 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "how many signatories does south korea have?"}, {"role": "assistant", "content": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1891 wd:Q884 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Which nomination did Shelley Winters receive for her work in \"A place in the Sun\"?"}, {"role": "assistant", "content": "SELECT ?obj WHERE { wd:Q202144 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P1686 wd:Q733627 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the active ingredients of the pharmaceutical product niacin"}, {"role": "assistant", "content": "select distinct ?sbj where { ?sbj wdt:P3781 wd:Q134658 . ?sbj wdt:P31 wd:Q28885102 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the mass media which start with the letter youtube"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11033 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'youtube')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the health profession which start with the letter r"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3922583 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'r')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the interdisciplinary science which start with the letter toxicology"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1665984 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'toxicology')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Where is the work location of Harthacanute which belongs to Asian Development Bank"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q190091 wdt:P937 ?answer . ?answer wdt:P463 wd:Q188822}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the phonetic alphabet which start with the letter t"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q579287 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me the festival which starts with the letter v!"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q132241 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the hot spring which start with the letter u"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q177380 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'u')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Which is the shopping day that starts with \"b\"?"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q43516519 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'b')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What takes place on Rosh Hashanah in the month of Tishrei?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q131028 wdt:P837 ?answer . ?answer wdt:P2922 wd:Q217782}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What city in New York was Martin Balsam born in?"}, {"role": "assistant", "content": "SELECT ?obj WHERE { wd:Q312107 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P131 wd:Q1384 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "TELL ME HISTORICAL REGION THAT STARTS WITH THE LETTER V"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1620908 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is Mizoram?"}, {"role": "assistant", "content": "select distinct ?obj where { wd:Q1502 wdt:P3403 ?obj . ?obj wdt:P31 wd:Q57156205 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is the name of the invention by Humphry Davy that uses Faraday's law of induction?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q181465 wdt:P138 ?answer . ?answer wdt:P737 wd:Q131761}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me me a cryptocurrenc whose name consist of the word \"neo\" and whose stock exchange bitfinex"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13479982 . ?sbj wdt:P414 wd:Q29647473 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'neo')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Which is the trend that contains the word zlatkoisierung in it's name?"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1514415 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zlatkoisierung')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What does the statue of Dante Alighieri depict"}, {"role": "assistant", "content": "select distinct ?sbj where { ?sbj wdt:P180 wd:Q1067 . ?sbj wdt:P31 wd:Q179700 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Who gave the{effect of} of {represents} of {Old Woman} ?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q29656429 wdt:P180 ?X . ?X wdt:P828 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me  a album whose name consist of the word wall and whose english is the language of work"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q482994 . ?sbj wdt:P407 wd:Q1860 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'wall')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the intergovernmental organization that contains the word southern in their name"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q245065 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'southern')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is the Wikimedia list page for The Thinker"}, {"role": "assistant", "content": "select distinct ?sbj where { ?sbj wdt:P360 wd:Q18003128 . ?sbj wdt:P31 wd:Q13406463 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is the topic of Bar whose Universal Decimal Classification is 34?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q17015569 wdt:P1269 ?answer . ?answer wdt:P1190 ?x FILTER(contains(?x,'34'))}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Where does Jean-Jacques Rousseau live"}, {"role": "assistant", "content": "select distinct ?sbj where { ?sbj wdt:P466 wd:Q6527 . ?sbj wdt:P31 wd:Q3947 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What female is not the same as Kevin Durant who is male?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q29545 wdt:P1889 ?answer . ?answer wdt:P21 wd:Q6581097}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is the hinfluence of the language of expression of Christina Grimmie?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q231713 wdt:P1412 ?X . ?X wdt:P737 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Which is the {taxon rank} and the {parent taxon} of {Armadillo} ?"}, {"role": "assistant", "content": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q47867 wdt:P105 ?ans_1 . wd:Q47867 wdt:P171 ?ans_2 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Name the substantial in period for Leipzig which has situated in time zone as UTC+02: 00."}, {"role": "assistant", "content": "SELECT ?value WHERE { wd:Q2079 p:P421 ?s . ?s ps:P421 wd:Q6723 . ?s pq:P1264 ?value}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Name the profession of someone working with statistics"}, {"role": "assistant", "content": "select distinct ?obj where { wd:Q12483 wdt:P3095 ?obj . ?obj wdt:P31 wd:Q28640 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me mythical human-animal hybrid that contains the word polkan in their name"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20902363 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'polkan')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What award did Ya\u015far Kemal receive from G\u00fcnter Grass?"}, {"role": "assistant", "content": "SELECT ?obj WHERE { wd:Q327142 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P823 wd:Q6538 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Who is the developer of Stirling engine whose died in Galston"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q186212 wdt:P61 ?answer . ?answer wdt:P20 wd:Q3997296}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is the musical instrument of the songwriter of \"Piano Concerto No. 5\"?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q239700 wdt:P86 ?X . ?X wdt:P1303 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "When was John Dalberg-Acton, 1st Baron Acton, elected as the Member of the 19th Parliament of the United Kingdom?"}, {"role": "assistant", "content": "SELECT ?value WHERE { wd:Q311778 p:P39 ?s . ?s ps:P39 wd:Q41582559 . ?s pq:P2715 ?value}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the album which start with the letter w"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q482994 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Which communications protocol contains the word zmodem in their name"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q132364 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zmodem')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "TELL ME CREDIT INSTITUTION WHOSE NAME HAS THE WORD WACHOVIA IN TI"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q730038 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'wachovia')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me system of units whose name has the word units in it."}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q932268 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'units')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Which is the big city in the continent of North America that starts with the letter v?:"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1549591 . ?sbj wdt:P30 wd:Q49 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What type of quantum particle is the antiparticle of an electon."}, {"role": "assistant", "content": "select distinct ?sbj where { ?sbj wdt:P2152 wd:Q2225 . ?sbj wdt:P31 wd:Q22675015 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What university starts with the letter \"u\"?"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3918 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'u')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "which is portrayed by famous work of weng qingxi"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q15936419 wdt:P800 ?X . ?X wdt:P175 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What sports are included in the biathlon"}, {"role": "assistant", "content": "select distinct ?sbj where { ?sbj wdt:P641 wd:Q166788 . ?sbj wdt:P31 wd:Q5 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the enterprise which start with the letter s"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6881511 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
