{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me fictional detective whose name has the word sam in it."}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q223638 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), '\u05d0\u05e8\u05e5')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What was the position of Fernando \u00c1lvarez de Toledo in 1581?"}, {"role": "assistant", "content": "SELECT ?obj WHERE { wd:Q80847 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1581')) }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me album whose name has the word wall in it."}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q482994 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'wall')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "In Macbeth, King of Scotland what gender identify is often confused with man?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q244403 wdt:P21 ?answer . ?answer wdt:P1889 wd:Q8441}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Who is {titleholder} of {nomination received} of {Jeffrey Ford} ?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q2495863 wdt:P1411 ?X . ?X wdt:P1346 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What were the immediate effects ot the Battle of Fort Sumter?"}, {"role": "assistant", "content": "select distinct ?sbj where { ?sbj wdt:P1478 wd:Q543165 . ?sbj wdt:P31 wd:Q8465 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Name a city in Iran that begins with the letter z"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q56557504 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me a legal case that begins with the letter \"u\" and applies jurisdiction to the United States."}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2334719 . ?sbj wdt:P1001 wd:Q30 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'u')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is the name of an embankment dam that starts with the letter h."}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1244922 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'h')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is part  series of successor of The Dinner Party ?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q16744169 wdt:P156 ?X . ?X wdt:P179 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "what is branch of biology that starts with z"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28598684 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "who is daddy of movie director for Valentine's Day ?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q27671399 wdt:P57 ?X . ?X wdt:P22 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the modern languages which start with the letter t"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1288568 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Who is the maternal half-sister of Mary Shelley?"}, {"role": "assistant", "content": "SELECT ?obj WHERE { wd:Q47152 p:P3373 ?s . ?s ps:P3373 ?obj . ?s pq:P1039 wd:Q19595229 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me iba official cocktail whose name has the word vesper in it."}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2536409 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'vesper')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me novel series whose name has the word twilight  in it."}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1667921 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'twilight')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the administrative divisions of Gummo Marx's citizenship?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q504548 wdt:P27 ?X . ?X wdt:P150 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Which historical country that is the  Head of government Franti\u0161ek Udr\u017eal and which that starts with the letter c"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3024240 . ?sbj wdt:P6 wd:Q2756999 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'c')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the comic strip which start with the letter z"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q838795 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What biological process is used for DNA replication"}, {"role": "assistant", "content": "select distinct ?obj where { wd:Q130996 wdt:P4774 ?obj . ?obj wdt:P31 wd:Q2996394 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "tell me literary character first appearance Action Comics #1 starts with s"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3658341 . ?sbj wdt:P4584 wd:Q5229132 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the atmosphere which start with the letter b"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q427085 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'b')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What republic starts with the letter \"z\"?"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7270 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "who taxonomic rank of higher taxon of treeswift ?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q31836 wdt:P171 ?X . ?X wdt:P105 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Who replaced V.P. Singh as Chief Minister of Uttar Pradesh?"}, {"role": "assistant", "content": "SELECT ?value WHERE { wd:Q315338 p:P39 ?s . ?s ps:P39 wd:Q28966983 . ?s pq:P1365 ?value}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Able to speak Ukrainian, what is Taras Shevchenko famous for?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q134958 wdt:P800 ?answer . ?answer wdt:P407 wd:Q8798}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Who is the{film} for {characters} of {Wyatt Earp}"}, {"role": "assistant", "content": "select distinct ?sbj where { ?sbj wdt:P4913 wd:Q9288 . ?sbj wdt:P31 wd:Q34770 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "WHICH IS THE SPACE PROGRAM THAT CONTAINS THE WORD SPACE IN THEIR NAME"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q60054001 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'space')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What does the Companhia do Metropolitano de S\u00e3o Paulo operate in the S\u00e3o Paulo Metr\u00f4?"}, {"role": "assistant", "content": "SELECT ?value WHERE { wd:Q483343 p:P137 ?s . ?s ps:P137 wd:Q38182538 . ?s pq:P518 ?value}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me syllable whose name has the word sen in it."}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q8188 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'sen')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Thomas Hunt Morgan is a doctoral advisor to how many?"}, {"role": "assistant", "content": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P184 wd:Q177681 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are thebarycenter which start with the letter center"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q809690 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'center')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "tell me sexual orientation that name has the word sex in it"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17888 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'sex')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What wards are in the Hautes-Pyrenees district?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q13377687 wdt:P1889 ?answer . ?answer wdt:P131 wd:Q12700}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is the tributary of the harbour of Duisburg ?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q2100 wdt:P206 ?X . ?X wdt:P974 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "which river has the steepest tributary"}, {"role": "assistant", "content": "select ?ent where { ?ent wdt:P31 wd:Q4022 . ?ent wdt:P4184 ?obj . ?ent wdt:P974 wd:Q46992264 } ORDER BY DESC(?obj)LIMIT 5"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Name the feminine name behind the language work of Russian"}, {"role": "assistant", "content": "select distinct ?sbj where { ?sbj wdt:P407 wd:Q7737 . ?sbj wdt:P31 wd:Q11879590 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me the ship type whose name has the word whaleback in it"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2235308 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'whaleback')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "WHat are the biomedical measurands that contain the word \"waist\" in their name ?"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q42014143 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'waist')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What what is animated taxondistributed by MGM and {family}"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16521 . ?sbj wdt:P105 wd:Q35409 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'xyridaceae')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the national sports team  which start with the letter t"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1194951 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are weapon studio which start with the letter z"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q728 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is { significant event } of { Eug\u00e8ne Delacroix } that is { location } is { Saint - Germain - des - Pr\u00e9s Abbey }?"}, {"role": "assistant", "content": "SELECT ?obj WHERE { wd:Q33477 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P276 wd:Q334186 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the borders of Kaifeng that contain the rural city of Fendquan District"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q208471 wdt:P47 ?answer . ?answer wdt:P150 wd:Q1198617}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What award did Amos Oss Vengurion receive in 2017-0-0?"}, {"role": "assistant", "content": "SELECT ?obj WHERE { wd:Q151872 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2017')) }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "How many crystal systems are in an amorphous solid?"}, {"role": "assistant", "content": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P556 wd:Q103382 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the municipality of West Bengal which start with the letter t"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q18918041 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Mention the ethnic group related to the Yiddish."}, {"role": "assistant", "content": "select distinct ?obj where { wd:Q8641 wdt:P2341 ?obj . ?obj wdt:P31 wd:Q41710 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "How many archives are at Harvard University?"}, {"role": "assistant", "content": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P485 wd:Q13371 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What position did F\u00e9lix Faure hold before he was replaced by \u00c9mile Loubet?"}, {"role": "assistant", "content": "SELECT ?obj WHERE { wd:Q296076 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1366 wd:Q169502 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "How many developers are placed at Department of Defense?"}, {"role": "assistant", "content": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P178 wd:Q11209 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Who is the {protein} for {physically interacts with} of {fentanyl}"}, {"role": "assistant", "content": "select distinct ?sbj where { ?sbj wdt:P129 wd:Q407541 . ?sbj wdt:P31 wd:Q8054 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Andriy Shevchenko played this position in what club?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q41244 wdt:P54 ?X . ?X wdt:P1352 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Name the stepparent of Sally Field."}, {"role": "assistant", "content": "select distinct ?obj where { wd:Q187033 wdt:P3448 ?obj . ?obj wdt:P31 wd:Q5 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the civilizations that start with the letter V"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q8432 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "WHICH IS THE PRIME NUMBER WITH THE MAXIMUM NUMERIC VALUE"}, {"role": "assistant", "content": "select ?ent where { ?ent wdt:P31 wd:Q49008 . ?ent wdt:P1181 ?obj } ORDER BY DESC(?obj)LIMIT 5"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Who is the business owner of Barbie the doll maker"}, {"role": "assistant", "content": "select distinct ?sbj where { ?sbj wdt:P1830 wd:Q167447 . ?sbj wdt:P31 wd:Q4830453 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Name the active ingredient in amoxicillin."}, {"role": "assistant", "content": "select distinct ?obj where { wd:Q201928 wdt:P3780 ?obj . ?obj wdt:P31 wd:Q28885102 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is the document published by the National Constituent Assembly that contains the word \"citizen\" in its name"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q49848 . ?sbj wdt:P98 wd:Q876424 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'citizen')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the world day which start with the letter n"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2558684 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'n')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What ethnoreligious group starts with the letter \"y\"?"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11197007 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'y')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "When did Jerome Bruner receive an APA Award for Distinguished Scientific Contributions to Psychology?"}, {"role": "assistant", "content": "SELECT ?value WHERE { wd:Q114867 p:P166 ?s . ?s ps:P166 wd:Q17112655 . ?s pq:P585 ?value}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "WHAT ARE THE WORD THAT  ROOT WHICH CONTAINS TYPE OF MATHEMATICAL FUNCTION"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q47279819 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'root')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
