{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "business entity in Russia"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q172957 wdt:P176 ?answer . ?answer wdt:P1454 wd:Q134161}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Where in Essex can we find Sarah Miles' birthplace?"}, {"role": "assistant", "content": "SELECT ?obj WHERE { wd:Q231187 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P131 wd:Q23240 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "How many sports are in the country of Brunei?"}, {"role": "assistant", "content": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1532 wd:Q921 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Do you know that Stiftung that was founded by the late Ingvar Kamprad?"}, {"role": "assistant", "content": "select distinct ?sbj where { ?sbj wdt:P112 wd:Q216932 . ?sbj wdt:P31 wd:Q18631230 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What monotypic taxon contains the word \"trogloraptoridae\" in its name?"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q310890 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'trogloraptoridae')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me London borough whose name has the word london in it."}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q211690 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'london')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is the name of a private not for profit educational institution that starts with the letter u."}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23002054 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'u')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Who is the {human} for {father} of {Alexander Graham Bell}"}, {"role": "assistant", "content": "select distinct ?obj where { wd:Q34286 wdt:P22 ?obj . ?obj wdt:P31 wd:Q5 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Who was the spouse of S\u00e1ndor Pet\u0151fi in 1847?"}, {"role": "assistant", "content": "SELECT ?obj WHERE { wd:Q81219 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1847')) }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the thoracic disease which start with the letter s"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q18553676 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "When was Carl Banks employed by the Walt Disney Company?"}, {"role": "assistant", "content": "SELECT ?value WHERE { wd:Q11941 p:P108 ?s . ?s ps:P108 wd:Q2216535 . ?s pq:P580 ?value}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Appointed by John Dryden, who held the position as Poet Laureate of the United Kingdom?"}, {"role": "assistant", "content": "SELECT ?value WHERE { wd:Q213355 p:P39 ?s . ?s ps:P39 wd:Q877838 . ?s pq:P748 ?value}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the ancient city which start with the letter z"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15661340 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me the relationship that exists between Johann Sebastian Bach and Johann Jacob Bach"}, {"role": "assistant", "content": "SELECT ?value WHERE { wd:Q1339 p:P3373 ?s . ?s ps:P3373 wd:Q539427 . ?s pq:P1039 ?value}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "WHICH IS ARRODISSEMENTS OF COUNTRY SEAT FOE YAREN DISTRICT"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q31026 wdt:P1376 ?X . ?X wdt:P150 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Who commissioned the Taj Mehal"}, {"role": "assistant", "content": "select distinct ?obj where { wd:Q9141 wdt:P88 ?obj . ?obj wdt:P31 wd:Q5 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is Guerrillerico Heroico's motif, whose death date is 1967-10-9?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q498216 wdt:P180 ?answer . ?answer wdt:P570 ?x FILTER(contains(YEAR(?x),'1967'))}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Who is C. V. Raman's doctor"}, {"role": "assistant", "content": "select distinct ?sbj where { ?sbj wdt:P184 wd:Q60429 . ?sbj wdt:P31 wd:Q5 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Who are the authors of The Republic, whose school is Platonism?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q123397 wdt:P50 ?answer . ?answer wdt:P135 wd:Q193589}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What territory was Wroc\u0142aw a part of during 1138?"}, {"role": "assistant", "content": "SELECT ?obj WHERE { wd:Q1799 p:P131 ?s . ?s ps:P131 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1138')) }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Give the name of the taxon with the lowest chromosome quantity whose progenitor is Passifloraceae."}, {"role": "assistant", "content": "select ?ent where { ?ent wdt:P31 wd:Q16521 . ?ent wdt:P5230 ?obj . ?ent wdt:P171 wd:Q157164} ORDER BY ASC(?obj)LIMIT 5"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Who is the {human} for {student} of {Francis Bacon}"}, {"role": "assistant", "content": "select distinct ?sbj where { ?sbj wdt:P802 wd:Q37388 . ?sbj wdt:P31 wd:Q5 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me mineral supergroup whose name has the word tourmalines in it."}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3977918 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tourmalines')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "which binary relation starts with the letter s"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q130901 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What medals are the leader of Alfredo Di Stefano?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q164546 wdt:P166 ?X . ?X wdt:P1346 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What mechanical property of materials starts with the letter \"y\"?"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5725005 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'y')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "gsdfhgdfh"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q1149738 wdt:P676 ?answer . ?answer wdt:P1477 ?x FILTER(contains(?x,'Antonio Romero M\u00e1rquez'))}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the unary operation that starts with s"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q657596 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "How many composers worked on Fantasia?"}, {"role": "assistant", "content": "SELECT (COUNT(?obj) AS ?value ) { wd:Q943192 wdt:P86 ?obj }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Name the  psychoactive drug made from Papaver somniferum that starts with letter O"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3706669 . ?sbj wdt:P1582 wd:Q131584 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'o')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the historical ethnical group which start with the letter xiongnu"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4204501 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'xiongnu')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Which infectious disease is caused by Staphylococcus aureus?"}, {"role": "assistant", "content": "select distinct ?sbj where { ?sbj wdt:P828 wd:Q188121 . ?sbj wdt:P31 wd:Q18123741 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is  translation for originating source of L\u00ea dynasty ?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q10800789 wdt:P248 ?X . ?X wdt:P747 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Species. See text. Cupressus is one of several genera within the family Cupressaceae that have the common name cypress; for the others, see cypress. It is considered a polyphyletic group. Based on genetic and morphological analysis, the genus Cupressus is found in the subfamily Cupressoideae."}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q146911 wdt:P171 ?X . ?X wdt:P105 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Name the stratovolcano of highest topographic prominence in the South American continent."}, {"role": "assistant", "content": "select ?ent where { ?ent wdt:P31 wd:Q169358 . ?ent wdt:P2660 ?obj . ?ent wdt:P30 wd:Q18 } ORDER BY DESC(?obj)LIMIT 5"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "In which house did James Watt die?"}, {"role": "assistant", "content": "select distinct ?obj where { wd:Q9041 wdt:P20 ?obj . ?obj wdt:P31 wd:Q3947 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "TELL ME VEGETATION ZONE WHOSE NAME HAS THE WORD TAIGA IN IT"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2083910 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'taiga')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What aircraft hijacking caused the War on Terror?"}, {"role": "assistant", "content": "select distinct ?obj where { wd:Q185729 wdt:P1478 ?obj . ?obj wdt:P31 wd:Q898712 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Name the award received by George Boole in 1844"}, {"role": "assistant", "content": "SELECT ?obj WHERE { wd:Q134661 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1844')) }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Name a university affiliated to Purdue University that contains the word \"Purdue\" in its name"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q615150 . ?sbj wdt:P1416 wd:Q929715 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'purdue')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": ""}, {"role": "assistant", "content": "select distinct ?obj where { wd:Q65 wdt:P47 ?obj . ?obj wdt:P31 wd:Q123705 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me sport discipline whose name has the word  wheelchair in it."}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2312410 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'wheelchair')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "When did Ginger Lynn receive an AVN Award?"}, {"role": "assistant", "content": "SELECT ?value WHERE { wd:Q233596 p:P166 ?s . ?s ps:P166 wd:Q824540 . ?s pq:P585 ?value}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the national cuisine which start with the letter m"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1968435 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'm')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is the language official of World Baseball Softball Confederation whose typology is nominative\u2013accusative language?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q11362472 wdt:P37 ?answer . ?answer wdt:P4132 wd:Q178435}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Which major did Kenneth Arrow achieve at Columbia University?"}, {"role": "assistant", "content": "SELECT ?value WHERE { wd:Q192592 p:P69 ?s . ?s ps:P69 wd:Q49088 . ?s pq:P812 ?value}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "How many cites were there for Dracula?"}, {"role": "assistant", "content": "SELECT (COUNT(?obj) AS ?value ) { wd:Q41542 wdt:P2860 ?obj }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is music genre of comes before  I mine \u00f8jne ?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q3791021 wdt:P156 ?X . ?X wdt:P136 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are dog breed which start with the letter w"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q39367 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "When was the Hyogo Prefecture first known as \"Western Australia\"?"}, {"role": "assistant", "content": "SELECT ?value WHERE { wd:Q130290 p:P190 ?s . ?s ps:P190 wd:Q3206 . ?s pq:P580 ?value}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is the correct way to say \"ecology\" in German?"}, {"role": "assistant", "content": "SELECT ?obj WHERE { wd:Q7150 p:P443 ?s . ?s ps:P443 ?obj . ?s pq:P407 wd:Q188 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Name an athlete competing in long jump"}, {"role": "assistant", "content": "select distinct ?sbj where { ?sbj wdt:P2416 wd:Q170737 . ?sbj wdt:P31 wd:Q5 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Name a parent taxon of Spinacia oleracea"}, {"role": "assistant", "content": "select distinct ?obj where { wd:Q81464 wdt:P171 ?obj . ?obj wdt:P31 wd:Q16521 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "When Camille Pissarro ended to work at Netherlands?"}, {"role": "assistant", "content": "SELECT ?value WHERE { wd:Q134741 p:P937 ?s . ?s ps:P937 wd:Q55 . ?s pq:P582 ?value}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is a cinematic technique that starts with the letter t."}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1001378 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Victor Hugo is the father to how many individuals?"}, {"role": "assistant", "content": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P22 wd:Q535 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "When did Akita start in twinned administrative body at St. Cloud"}, {"role": "assistant", "content": "SELECT ?value WHERE { wd:Q17139 p:P190 ?s . ?s ps:P190 wd:Q736834 . ?s pq:P580 ?value}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Which religious group is the largest within Christianity?"}, {"role": "assistant", "content": "select distinct ?sbj where { ?sbj wdt:P2184 wd:Q235329 . ?sbj wdt:P31 wd:Q6957341 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Which London District Line staion has the least number of passengers"}, {"role": "assistant", "content": "select ?ent where { ?ent wdt:P31 wd:Q14562709 . ?ent wdt:P3872 ?obj . ?ent wdt:P81 wd:Q211265} ORDER BY ASC(?obj)LIMIT 5"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "For which work did Alan Jay Lerner win Best Writing and Adapted Screenplay at the Academy Awards for?"}, {"role": "assistant", "content": "SELECT ?value WHERE { wd:Q961893 p:P166 ?s . ?s ps:P166 wd:Q107258 . ?s pq:P805 ?value}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the neighborhood  which start with the letter z"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q123705 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Where is Sindh geographically located"}, {"role": "assistant", "content": "select distinct ?obj where { wd:Q37211 wdt:P2633 ?obj . ?obj wdt:P31 wd:Q46865913 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the conjecture which start with the letter problem"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q319141 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'problem')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Where in P\u00e8re Lachaise Cemetery is Jean-Fran\u00e7ois Champollion buried?"}, {"role": "assistant", "content": "SELECT ?value WHERE { wd:Q260 p:P119 ?s . ?s ps:P119 wd:Q311 . ?s pq:P965 ?value}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What what is divide and conquer algorithm discoverer or inventor Tony Hoare  \n and also which starts with letter q"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q671298 . ?sbj wdt:P61 wd:Q92602 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'q')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
