{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "tell  me class of instruments which name has  the word instrument in it"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1254773 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'instrument')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Name a city that contains the word \"milwaukee \" in its name"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15221304 . ?sbj wdt:P237 wd:Q7440568 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'milwaukee')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me psychoactive drug  whose name has the word opium  in it."}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3706669 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'opium')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "How do you pronounce Georges Pompidous name? It's French."}, {"role": "assistant", "content": "SELECT ?obj WHERE { wd:Q2185 p:P443 ?s . ?s ps:P443 ?obj . ?s pq:P407 wd:Q150 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Name a country where people speak english and that starts with letter z"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6256 . ?sbj wdt:P37 wd:Q1860 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is the performer and occupation of Merlin"}, {"role": "assistant", "content": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q188044 wdt:P175 ?ans_1 . wd:Q188044 wdt:P106 ?ans_2 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me me a ethnic group whose name consist of the word \"sioux\" and whose language used Sioux"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q41710 . ?sbj wdt:P2936 wd:Q13268 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'sioux')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What product was built by Asus ZenWatch 3?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q30161124 wdt:P176 ?X . ?X wdt:P1056 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Who is Garrison of Indiana University Bloomington residing in Monroe County?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q1079140 wdt:P159 ?answer . ?answer wdt:P131 wd:Q512699}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "WHICH IS THE MOTIVATION PARTY OF WARSAW PACT INVASION OF CZECHOSLOVAKIA"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q1773668 wdt:P710 ?X . ?X wdt:P1451 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Which  member of party of Klaus G\u00e4rtner ?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q1745154 wdt:P102 ?X . ?X wdt:P463 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "When did Gottlob Frege acquire his academic degree in habilitation."}, {"role": "assistant", "content": "SELECT ?value WHERE { wd:Q60028 p:P512 ?s . ?s ps:P512 wd:Q308678 . ?s pq:P585 ?value}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "TELL ME DOG WHOSE NAME HAS THE WORD ULK IN IT"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q144 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'ulk')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "which language that starts with u"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q34770 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'u')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "what is w3c recommendation starts with x"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2661442 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'x')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Which is the one responsible commander for John Ledyard's headed branch"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q718690 wdt:P241 ?X . ?X wdt:P4791 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "How many engines does the Airbus A320 have ?"}, {"role": "assistant", "content": "SELECT (COUNT(?obj) AS ?value ) { wd:Q6475 wdt:P516 ?obj }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "WHICH IS THE WEB SEARCH ENGINE THAT STARTS WITH Y"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4182287 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'y')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Name a science award conferred by Columbia Universit that starts with letter P"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11448906 . ?sbj wdt:P1027 wd:Q49088 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'p')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the currency  which start with the letter yen"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q8142 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yen')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is the Q48460 of the place of incorporation of Guns N\u2019 Roses ?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q11895 wdt:P740 ?X . ?X wdt:P1036 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "When is Philo's birthday."}, {"role": "assistant", "content": "SELECT ?obj WHERE { wd:Q189597 p:P569 ?s . ?s ps:P569 ?obj . ?s pq:P1480 wd:Q5727902 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is the Hanseatic city with the highest vehicles per capita (1000) whose category of associated people is Category:People from L\u00fcbeck?"}, {"role": "assistant", "content": "select ?ent where { ?ent wdt:P31 wd:Q707813 . ?ent wdt:P5167 ?obj . ?ent wdt:P1792 wd:Q8741076 } ORDER BY DESC(?obj)LIMIT 5"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "How are Sophia of Hanover and Elizabeth Charlotte, Princess Palatine related?"}, {"role": "assistant", "content": "SELECT ?value WHERE { wd:Q57224 p:P1038 ?s . ?s ps:P1038 wd:Q57221 . ?s pq:P1039 ?value}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "give me the coordinates of the river mouth of the river Ganges."}, {"role": "assistant", "content": "SELECT ?obj WHERE { wd:Q5089 p:P625 ?s . ?s ps:P625 ?obj . ?s pq:P518 wd:Q1233637 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "How many people are on the New York Yankees?"}, {"role": "assistant", "content": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P466 wd:Q213417 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the regions of the sovereign state of Baoting Li and Miao Autonomous County?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q807080 wdt:P17 ?X . ?X wdt:P150 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Who is the member of Olivier Messiaen, whose longitude is -73.9469"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q151593 wdt:P463 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'-73.9469'))}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What do the stars on the United States of America symbolize?"}, {"role": "assistant", "content": "SELECT ?value WHERE { wd:Q42537 p:P180 ?s . ?s ps:P180 wd:Q372254 . ?s pq:P4878 ?value}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the warfare which start with the letter w"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12786121 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "WHICH  SPORTS IS SUCCEDED  ON 1993 RALLY GB"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q6361563 wdt:P156 ?X . ?X wdt:P641 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is the Czechoslovakia member that has maxime of \u0421\u043e\u044e\u0437 \u043c\u0438\u0440\u0430 \u0438 \u0441\u043e\u0446\u0438\u0430\u043b\u0438\u0437\u043c\u0430?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q33946 wdt:P463 ?answer . ?answer wdt:P1451 ?x FILTER(contains(?x,'\u0421\u043e\u044e\u0437 \u043c\u0438\u0440\u0430 \u0438 \u0441\u043e\u0446\u0438\u0430\u043b\u0438\u0437\u043c\u0430'))}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "When was Leonardo DiCaprio nominated for the Academy Award for Best Actor."}, {"role": "assistant", "content": "SELECT ?value WHERE { wd:Q38111 p:P1411 ?s . ?s ps:P1411 wd:Q103916 . ?s pq:P585 ?value}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Who is the {skyscraper} for {based on} of {Flatiron Building}"}, {"role": "assistant", "content": "select distinct ?sbj where { ?sbj wdt:P144 wd:Q220728 . ?sbj wdt:P31 wd:Q11303 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What town is near where Yi Sun-sin was born."}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q50184 wdt:P19 ?X . ?X wdt:P190 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "When was Hartmut Mehdorn appointed a director at Deutsche Bahn?"}, {"role": "assistant", "content": "SELECT ?value WHERE { wd:Q9322 p:P1037 ?s . ?s ps:P1037 wd:Q91984 . ?s pq:P580 ?value}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What was Maggie Cheung's statement of subject when she was nominated for the Cesar Award for Best Actress?"}, {"role": "assistant", "content": "SELECT ?value WHERE { wd:Q234778 p:P1411 ?s . ?s ps:P1411 wd:Q24241 . ?s pq:P805 ?value}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What town is twinned with 2NE1?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q171885 wdt:P740 ?X . ?X wdt:P190 ?answer}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Name someone who graduated from McGill University"}, {"role": "assistant", "content": "select distinct ?sbj where { ?sbj wdt:P1416 wd:Q201492 . ?sbj wdt:P31 wd:Q5 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Name the shortest wheelbased Sport motorcycle"}, {"role": "assistant", "content": "select ?ent where { ?ent wdt:P31 wd:Q23866334 . ?ent wdt:P3039 ?obj . ?ent wdt:P279 wd:Q1339146. } ORDER BY ASC(?obj)LIMIT 5"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is the taxonomy and study of trees?"}, {"role": "assistant", "content": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q10884 wdt:P2579 ?ans_1 . wd:Q10884 wdt:P1672 ?ans_2 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "WHAT IS GEOLOGICAL SUPEREON THAT STARTS WITH P"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15398983 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'p')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me the medication used for the treatment of post-traumatic stress disorder."}, {"role": "assistant", "content": "select distinct ?obj where { wd:Q202387 wdt:P2176 ?obj . ?obj wdt:P31 wd:Q12140 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "When did Ra\u00fal Castro marry Vilma Esp\u00edn?"}, {"role": "assistant", "content": "SELECT ?value WHERE { wd:Q46809 p:P26 ?s . ?s ps:P26 wd:Q466662 . ?s pq:P580 ?value}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is the type of procedure for the taxonomy of Durio"}, {"role": "assistant", "content": "select distinct ?obj where { wd:Q2309085 wdt:P427 ?obj . ?obj wdt:P31 wd:Q16521 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Tell me cave whose name has the word sesselfelsgrotte in it."}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q35509 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'sesselfelsgrotte')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Who replaced Arthur Fadden's held position as Prime Minister of Australia?"}, {"role": "assistant", "content": "SELECT ?value WHERE { wd:Q23369 p:P39 ?s . ?s ps:P39 wd:Q319145 . ?s pq:P1365 ?value}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What is the Hebrew writing system"}, {"role": "assistant", "content": "select distinct ?obj where { wd:Q9288 wdt:P282 ?obj . ?obj wdt:P31 wd:Q185087 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What year was Edward Smith-Stanley's last year as Prime Minister of the United Kingdom?"}, {"role": "assistant", "content": "SELECT ?value WHERE { wd:Q237829 p:P39 ?s . ?s ps:P39 wd:Q14211 . ?s pq:P582 ?value}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "which civil code starts with c"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1923776 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'c')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the economic policy which start with the letter t"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q582577 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the recurring events which start with the letter w"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15275719 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are the railway tunnel which start with the letter T"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1311958 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are theprogramming language which start with the letter x"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q9143 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'x')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Is Kuala Lumpur the state of Malaysia"}, {"role": "assistant", "content": "select distinct ?obj where { wd:Q1865 wdt:P501 ?obj . ?obj wdt:P31 wd:Q15063586 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "When did C. Everett Koop stop being the Surgeon General of the United States?"}, {"role": "assistant", "content": "SELECT ?value WHERE { wd:Q3306168 p:P39 ?s . ?s ps:P39 wd:Q1434880 . ?s pq:P582 ?value}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What the heck is Navier-Stokes equations in mathematics?"}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q201321 wdt:P138 ?answer . ?answer wdt:P106 wd:Q170790}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Heterosexuality is a type of sexual orientation?"}, {"role": "assistant", "content": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P91 wd:Q1035954 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "\"Which is {language of work} of {bey}, whose {typology} is {subject\u2013object\u2013verb language} ?\""}, {"role": "assistant", "content": "SELECT ?answer WHERE { wd:Q181217 wdt:P407 ?answer . ?answer wdt:P4132 wd:Q539808}"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Explain the historical process of a polymerase chain reaction."}, {"role": "assistant", "content": "select distinct ?sbj where { ?sbj wdt:P1269 wd:Q176996 . ?sbj wdt:P31 wd:Q17524420 }"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "which isotope of Platinum has the lowest binding energy"}, {"role": "assistant", "content": "select ?ent where { ?ent wdt:P31 wd:Q19475 . ?ent wdt:P2154 ?obj . ?ent wdt:P279 wd:Q880. } ORDER BY ASC(?obj)LIMIT 5"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Name a landmark located in the administrative territorial entity of Old Toronto that starts with letter C"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2319498 . ?sbj wdt:P131 wd:Q919169 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'c')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "What are thewater deity which start with the letter'y"}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1916821 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'y')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
{"messages": [{"role": "system", "content": "You are a SPARQL generator for Wikidata. Given a natural language question, return a syntactically correct and executable SPARQL query using the Wikidata ontology. Respond only with the query"}, {"role": "user", "content": "Give me a country name which has economic crisis at present, that starts with an alphabet 'p'."}, {"role": "assistant", "content": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q290178 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'p')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25"}]}
